; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	instrument10 - instrument
	satellite5 - satellite
	instrument11 - instrument
	satellite6 - satellite
	instrument12 - instrument
	instrument13 - instrument
	spectrograph1 - mode
	image2 - mode
	image0 - mode
	Star1 - direction
	GroundStation7 - direction
	Star0 - direction
	GroundStation4 - direction
	Star6 - direction
	GroundStation5 - direction
	GroundStation8 - direction
	GroundStation3 - direction
	Star2 - direction
	Star9 - direction
	Phenomenon10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Star13 - direction
	Phenomenon14 - direction
)
(:init
	(supports instrument0 image2)
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 Star1)
	(calibration_target instrument0 GroundStation3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star11)
	(supports instrument1 image0)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 Star1)
	(supports instrument2 image0)
	(calibration_target instrument2 Star0)
	(calibration_target instrument2 GroundStation4)
	(calibration_target instrument2 GroundStation5)
	(supports instrument3 image0)
	(supports instrument3 image2)
	(calibration_target instrument3 GroundStation7)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star11)
	(supports instrument4 image0)
	(supports instrument4 spectrograph1)
	(calibration_target instrument4 Star0)
	(supports instrument5 image0)
	(calibration_target instrument5 GroundStation8)
	(calibration_target instrument5 GroundStation4)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star0)
	(supports instrument6 image2)
	(supports instrument6 spectrograph1)
	(calibration_target instrument6 Star0)
	(calibration_target instrument6 Star2)
	(calibration_target instrument6 GroundStation5)
	(supports instrument7 image2)
	(supports instrument7 spectrograph1)
	(supports instrument7 image0)
	(calibration_target instrument7 Star2)
	(calibration_target instrument7 GroundStation4)
	(calibration_target instrument7 Star6)
	(supports instrument8 spectrograph1)
	(supports instrument8 image2)
	(calibration_target instrument8 GroundStation4)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star11)
	(supports instrument9 image2)
	(calibration_target instrument9 Star6)
	(calibration_target instrument9 GroundStation5)
	(supports instrument10 spectrograph1)
	(calibration_target instrument10 GroundStation8)
	(calibration_target instrument10 Star2)
	(calibration_target instrument10 GroundStation5)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation3)
	(supports instrument11 image2)
	(supports instrument11 image0)
	(supports instrument11 spectrograph1)
	(calibration_target instrument11 GroundStation8)
	(calibration_target instrument11 GroundStation3)
	(on_board instrument11 satellite5)
	(power_avail satellite5)
	(pointing satellite5 GroundStation8)
	(supports instrument12 image2)
	(supports instrument12 image0)
	(supports instrument12 spectrograph1)
	(calibration_target instrument12 GroundStation3)
	(calibration_target instrument12 Star2)
	(supports instrument13 spectrograph1)
	(supports instrument13 image0)
	(supports instrument13 image2)
	(calibration_target instrument13 Star2)
	(on_board instrument12 satellite6)
	(on_board instrument13 satellite6)
	(power_avail satellite6)
	(pointing satellite6 Star11)
)
(:goal (and
	(pointing satellite0 Star2)
	(pointing satellite1 Star2)
	(pointing satellite2 Star11)
	(pointing satellite3 Star9)
	(pointing satellite6 Phenomenon10)
	(have_image Star9 spectrograph1)
	(have_image Phenomenon10 image2)
	(have_image Star11 image2)
	(have_image Phenomenon12 spectrograph1)
	(have_image Star13 spectrograph1)
	(have_image Phenomenon14 spectrograph1)
))

)

; plan
1. (turn_to satellite3 groundstation5 star11)
   deleted: (pointing satellite3 star11)
   added: (pointing satellite3 groundstation5)
   goals met: 0 of 11
2. (switch_on instrument6 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument6)
   goals met: 0 of 11
3. (calibrate satellite3 instrument6 groundstation5)
   added: (calibrated instrument6)
   goals met: 0 of 11
4. (turn_to satellite3 phenomenon14 groundstation5)
   deleted: (pointing satellite3 groundstation5)
   added: (pointing satellite3 phenomenon14)
   goals met: 0 of 11
5. (take_image satellite3 phenomenon14 instrument6 spectrograph1)
   added: (have_image phenomenon14 spectrograph1)
   goals met: 1 of 11
6. (turn_to satellite3 phenomenon12 phenomenon14)
   deleted: (pointing satellite3 phenomenon14)
   added: (pointing satellite3 phenomenon12)
   goals met: 1 of 11
7. (take_image satellite3 phenomenon12 instrument6 spectrograph1)
   added: (have_image phenomenon12 spectrograph1)
   goals met: 2 of 11
8. (turn_to satellite3 phenomenon10 phenomenon12)
   deleted: (pointing satellite3 phenomenon12)
   added: (pointing satellite3 phenomenon10)
   goals met: 2 of 11
9. (turn_to satellite2 star11 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 star11)
   goals met: 3 of 11
10. (turn_to satellite1 star2 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 star2)
   goals met: 4 of 11
11. (turn_to satellite0 star2 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star2)
   goals met: 5 of 11
12. (take_image satellite3 phenomenon10 instrument6 image2)
   added: (have_image phenomenon10 image2)
   goals met: 6 of 11
13. (turn_to satellite3 star11 phenomenon10)
   deleted: (pointing satellite3 phenomenon10)
   added: (pointing satellite3 star11)
   goals met: 6 of 11
14. (take_image satellite3 star11 instrument6 image2)
   added: (have_image star11 image2)
   goals met: 7 of 11
15. (turn_to satellite3 star13 star11)
   deleted: (pointing satellite3 star11)
   added: (pointing satellite3 star13)
   goals met: 7 of 11
16. (take_image satellite3 star13 instrument6 spectrograph1)
   added: (have_image star13 spectrograph1)
   goals met: 8 of 11
17. (turn_to satellite3 star9 star13)
   deleted: (pointing satellite3 star13)
   added: (pointing satellite3 star9)
   goals met: 9 of 11
18. (take_image satellite3 star9 instrument6 spectrograph1)
   added: (have_image star9 spectrograph1)
   goals met: 10 of 11
19. (turn_to satellite6 phenomenon10 star11)
   deleted: (pointing satellite6 star11)
   added: (pointing satellite6 phenomenon10)
   goals met: 11 of 11
